Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: If computational thinking should be taught for medical students in the context of provision of patient care, and for architects it should be presented in the context of design principles, for content professionals it should be in the processes, tools, and indicators required in an intelligent content workflow.
zh_cn: 如果应该在护理病人的情景下教医学生计算机思维，在设计原则的背景下教建筑师计算机思维，那么对于内容专员而言，应该在流程、工具和智能内容工作流所需的标记里教他们。

source: If content production can be automated, it still depends on humans as authors, information architects, and experience evaluators in order to be rhetorically effective.
zh_cn: 如果内容生产可以自动化了，其修辞效果依然依赖人类，需要创作者、信息架构师和经验评估师的参与。

source: If included in a topic, the YAML front matter header must be the first thing in the MDITA file and must be set between triple-dashed lines.
zh_cn: 如果 MDITA 文件有 YAML 前置块的话，则 YAML 前置块必须写在文件开头，位于两行三格虚线之间。

source: If no transformation scenario has been selected, the dialog box will direct you to the “Configure Transformation Scenario(s)” window.
zh_cn: 如果没有选择任何地图，对话框将引导你到“配置转换选项”（Configure Transformation Scenario(s)）窗口。

source: If so, the topics could end here and join a content collection to produce deliverables for end users.
zh_cn: 那么话题写作的部分就结束了，将这些话题内容聚合起来，就可以为终端用户生成可交付内容。

source: If something goes wrong during the transformation process (maybe one of your files had an extra tag, or there was a missing component in your version of the DITA-OT), the Toolkit will report an error.
zh_cn: 如果在转换过程中出现错误（可能因为某个文件有多余的标记，或者 DITA-OT 版本中缺少某个组件），DITA-OT 将报错。

source: If that sounds like a commercial, it is because the company behind the method emphasizes its copyright.
zh_cn: 如果这听起来像个广告，那是因为信息映射®方法的公司强调了它的版权。

source: If that validation process sounds a little too complicated, as an author all you need to know is that the content types enforced by the DITA standard create information topics.
zh_cn: 如果验证过程听起来有点太过复杂，作为作者只需要知道 DITA 标准规定的内容类型可以创建信息话题就行了。

source: If the earlier versions of Developing Quality Technical Information were, as Michael Priestley said, “all about DITA without mentioning DITA by its name,” that changed in the 3rd edition.
zh_cn: 如果像迈克尔·普里斯特利说的那样，《开发高质量技术信息》的早期版本“虽然没有提DITA，但实质就是DITA，”这一点在第三版中有所改变。

source: If the tool developers respect the standard, they allow for interoperability among tools.
zh_cn: 如果工具开发者尊重标准的话，他们会允许工具间的互操作性。

source: If the webinar is transcribed into text, and if that text is processed through the layers of abstraction needed to have it structured and tagged for human readers and machine processors, “the main work is done; everything else can be automated” (Rockley, 2016).
zh_cn: 罗克利以一家公司举办的网络研讨会为例，解释了内容开发的映射过程。如果研讨会的研讨内容被转录成文本，且文本需要通过经过抽象层级的处理，进行结构化，打上标签，以供人类阅读和机器处理，“映射就完成了，万物皆可自动化” (Rockley, 2016)。

source: If those pre-established topic types were not enough for a particular writer and context, DITA topics can be specialized to create information types unique to any intelligent content domain.
zh_cn: 如果这些预先建立的话题类型对于特定的作者和特定的语境需求来说还不够， 还可以特别定制DITA话题，以创建任何智能内容领域特有的信息类型。

source: If we can agree on what a lowered profile of expectation and need is, there are several benefits: 1.
zh_cn: 如果我们能在低预期和低需求是什么上达成一致，有以下几个好处： 1.

source: If you have never interacted with the DITA Open Toolkit, and if you are not familiar with command-line based applications, I recommend a couple of introductory videos developed by Scriptorium as part of their free “Learning DITA” curriculum1.
zh_cn: 如果你从未使用过 DITA Open Toolkit，也不熟悉基于命令行的应用程序，那么我推荐你观看Scriptorium（提供内容策略咨询服务的公司）免费制作的《学习 DITA》1课程中的几个介绍性视频。

source: If you learn how to sort numbers with recursion, do you also learn how to use recursion when developing a strategy for tiling your kitchen floor?” (Guzdial, 2016, p.
zh_cn: 如果你学会了如何用递归对数字排序，那么当你思考该如何铺厨房的地板时，你也知道该怎么使用递归吗？”(Guzdial, 2016, p.

source: If you want to try a DITA-aware tool with a GUI, you can download a 30-day trial of Oxygen XML Editor from the website https://www.oxygenxml. com/xml_editor.
zh_cn: 如果你想尝试具有 GUI 的 DITA 工具，可以从网址 https://www.oxygenxml. com/xml_editor 下载 Oxygen XML Editor，你将拥有30天的试用期。

source: If you're unfamiliar with XML structures, don't worry; the relevant XML elements for this book will be discussed in detail in subsequent chapters.
zh_cn: 如果你对 XML 结构不太熟悉，不用担心。后面的章节会详细讨论本书中出现的XML元素。

source: Image: a link to a graphic to be included in the content.
zh_cn: 图像（image）：内容中的图像。

source: Imagine being a student in Professional and Technical Writing and reading the books Topic-Driven Environmental Rhetoric and DITA - the Topic-Based XML Standard for different courses on the same semester.
zh_cn: 想象一下，作为一名专业技术写作的学生，在同一学期不同的课程中阅读《主题驱动的环境修辞》和《DITA - 基于主题的XML标准》。

source: Implementation of Elements: DITA is Born
zh_cn: 元素的应用：DITA诞生

source: In 1965, Robert E. Horn initiated the research into and design of the Information Mapping® method, initially developed as both a way of visually presenting information and a method for analyzing information to make it easier to communicate.
zh_cn: 1965年，Robert E. Horn开始对信息映射®方法进行研究和设计，最初发展为一种视觉化的信息呈现方式和分析信息的方法，使信息更易于交流。

source: In 1969, Horn and his co-authors released a report introducing the method as an approach for structuring and organizing training content, which included the following definition:
zh_cn: 1969年，霍恩和他的合著者发表了一份报告，表示信息映射是结构化和组织培训内容的一种方法，其定义如下：

source: In 1998, PQTI evolved into DQTI - the first edition of Developing Quality Technical Information: A Handbook for Writers and Editors, authored by Gretchen Hargis and published by IBM/Prentice Hall.
zh_cn: 1998, PQTI 演化成 DQTI - 即第一版 《开发高质量技术信息：作者和编辑的参照手册》,作者是格雷琴·哈吉斯 （Gretchen Hargis），由IBM/普伦蒂斯·霍尔联合出版。

source: In 2012, the Adobe Technical Communication Suite (TCS) team distributed on several social media channels a video titled “The Future of Technical Communication.” The video used stop-motion animation and fast-draw techniques to summarize the features of “Adobe's Tools and Services” for technical communication.
zh_cn: 2012年，Adobe 技术传播套件（TCS）团队在几个社交媒体渠道发布了一段名为“技术传播的未来”的视频。该视频使用定格动画和快速绘制技术，总结了用于技术传播的“Adobe 工具和服务”的特点。

source: In Chapter 3 I introduced the components of a LwDITA map, and those are expressed in XDITA as follows:
zh_cn: 在第3章中，我介绍了构建 LwDITA 地图的组件，在 XDITA 中这些组件的使用方式如下：

source: In Chapter 1, I gave a brief historical overview of the early DITA days at IBM, when the Customer and Service Information (C&SI), with work primarily conducted by Dave Schell, Don Day, and Michael Priestley started exploring XML as a language to create tags that would create templates for the genre conventions of commonly used content structures in the company's documentation.
zh_cn: 在 第一 章中, 我简短回顾了DITA在IBM的早期发展史，戴夫·席尔、唐·戴以及迈克尔·普里斯特利做出了杰出贡献，彼时用户与服务信息部门开始探索将XML作为一门语言来创建标签，为通用内容结构的体裁惯例创建模板，并应用至公司的所有文档。

source: In Figure 6.10, an MDITA extended profile with an assigned @id of “franchise- intro” uses a setext heading for its title component.
zh_cn: 图6.10展示了指定 @id 为“franchise- intro ”扩展配置的 MDITA 话题，该话题文件使用 setext 语法格式编写标题组件。

source: In Chapter 1, I mentioned an example of Chef Pedro, who could specialize elements of the DITA task content type into more meaningful components for his intended purpose (i.e., <ingredients> as a specialization of the default <prereq> for pre-requisites).
zh_cn: 在第一章中，我提到了佩德罗的例子，他能够根据自己特定的目的将DITA任务内容类型的各类元素专门化成更具意义的组件。（比如说<ingredients> 标签是默认元素的专门化，<prereq> 则是前期准备元素）

source: In Chapter 8, I introduce a model for content development with LwDITA that fosters rhetorical effectiveness through context-setting metadata and human-in-the-loop (HITL) requirements for automation.
zh_cn: 在第八章中，我将介绍一个使用 LwDITA 进行内容开发的模型，该模型通过上下文元数据和人类参与机器自动化循环训练（HITL）来提升修辞效果。

source: In Lightweight DITA: An Introduction, we wrote the following about the optional YAML header for MDITA topics:
zh_cn: 在《轻量级 DITA 简介》中，我们对 MDITA 话题的可选 YAML 头进行了以下介绍：

source: In Chapter 1, I mentioned that Chef Pedro probably needed a DITA-based content model that allowed authors to specialize a <task> into a <recipe>.
zh_cn: 在第1 章中，我提到厨师佩德罗可能需要一个基于 DITA 的内容模型，该模型允许作者将 <task> 专门化为 <recipe>。

source: In April 2015, Priestley and I, along with metadata expert Lu Ai (former project manager at IBM and currently with Pearson) gave a presentation titled “Does DITA Need Tags?” at the DITA North America/ CMS conference in Chicago, IL.
zh_cn: 2015年4月，我和普里斯特利以及元数据专家艾路（音译，前IBM项目经理，现供职于培生集团）在于伊利诺伊州的芝加哥举行的 DITA 北美/ CMS 会议上，一起做了一个题为“DITA需要标签吗?”的演讲。

source: In DITA 1.3 and HTML5 (the markup foundations for XDITA and HDITA, respectively) the following ordered list is valid:
zh_cn: 在DITA 1.3 和HTML5 （分别是XDITA和HDITA的标记基础）中，以下有序列表是有效的：

source: In DITA XML, that “system of pigeonholes” (the standard's elements and content types) allows authors to master specific forms of communication that enable the type of intelligent content discussed in this book.
zh_cn: 在DITA XML中，“鸽笼机制”（标准的元素和内容类型）能让作者掌握特定的传播形式，从而运用本书中讨论的智能内容类型。

source: In DITA, authors can create consistent topics to assemble collections of information with elements that can be reused even at the phrase level.
zh_cn: 在 DITA 中，作者可以创建一致的话题来组合信息，这些信息甚至包含短语级别的可复用元素。

source: In DITA, each content component corresponds to an element in XML (e.g., a paragraph is a <p> and a short description is a <shortdesc>).
zh_cn: 在 DITA 中，每个内容组件都对应着 XML 中的一个元素（例如，段落对应<p>，短描述对应<shortdesc>）。

source: In HDITA and MDITA topics, the optional short description is implied in the first paragraph of content.
zh_cn: 在 HDITA 和 MDITA 话题中，可选的简短描述组件隐含在内容的第一个段落中。

source: In HDITA, <article> has a required @id, that could have the same value as the file's name.
zh_cn: 在HDITA中，<article> 有必须要有 @id属性，其值可以和文件名相同。

source: In HDITA, a paragraph is also represented by opening and closing <p> tags, and paragraphs should be inside a body environment.
zh_cn: 在 HDITA 中，段落也是由一对 <p> 标签表示，并且段落包含在主主体组件中。

source: In John Carroll's opinion, today's developers and users have not really lost the itch to tinker with systems because the manuals disappeared.
zh_cn: 在约翰·卡罗尔看来，如今的开发者和用户并未因为手册的消失而真正丧失改进系统的渴望。

source: In LwDITA, however, XML is not the only authoring language; therefore, these components should not be seen exclusively as XML elements.
zh_cn: 然而，在 LwDITA 中，XML 不是唯一的写作语言，因此，不应该只将这些组件看作 XML 元素。

source: In MDITA core profile, any structure saved as Markdown format can work as a basic topic.
zh_cn: 在 MDITA 的核心规定中，任何保存为 Markdown 格式的结构都可以作为基础话题。

source: In MDITA extended profile, authors can specify an @id for the topic that overrides the “slugify” process.
zh_cn: 在 MDITA 扩展配置中，作者可以指定 @id 名称，覆盖自动解析生成的@id。

source: In MDITA, a paragraph is a sequence of non-blank lines and should be visually separated from other content components by a return or enter.
zh_cn: 在 MDITA 中，段落是非空行序列，应该使用回车将段落和其他内容组件划分开来。

source: In MDITA, the required @id should be automatically generated when the topic is saved, through a “slug”-generation process.
zh_cn: 在 MDITA 中， @id 会在保存话题时通过解析文件名称自动生成。

source: In March of 2012, when Michael Priestley officially proposed the development of a “lightweight framework for representing DITA topics,” it was a given that Lightweight DITA would be based on XML.
zh_cn: 2012年3月，当迈克尔·普里斯特利正式提议开发“用于表示DITA主题的轻量级框架”时，轻量级DITA是基于XML的，这是可以确定的。

source: In Markdown, a title is not required, so this one-line example can work as a valid basic (but useless for practical reasons) topic, even if its content is just a commented annotation.
zh_cn: Markdown不需要标题，因此即使示例只有一行注释，也是一个有效的基础话题（但该话题在实际应用中毫无用处）。

source: In October 2016, Kris Eberlein (chair of the DITA Technical Committee) requested a formal deliverable from the subcommittee: a committee note/white paper that would work as a proposal for the LwDITA standard.
zh_cn: 2016年10月，克里斯·埃伯莱因（DITA 技术委员会主席）要求小组委员会提交一份正式的交付文件：一份委员会说明/白皮书，作为 LwDITA 标准的提案。

source: In Oxygen XML Editor, a basic DITA transformation process requires just one click on the “Apply Transformation Scenario(s)” button (it
zh_cn: 在 Oxygen XML Editor 中，一个基本的 DITA 转换过程只需单击主工具栏上的“应用转换选项”（Apply Transformation Scenario(s)）按钮（该按钮

source: In Oxygen XML Editor, the HDITA map would be processed through the same steps as the XDITA and HDITA maps: by clicking on the “Apply Transformation Scenario(s)” button on the main toolbar.
zh_cn: 在 Oxygen XML Editor 中，处理 MDITA 地图的步骤与处理 XDITA 和 HDITA 地图的步骤相同：单击主工具栏上的“应用转换选项”按钮。

source: In Oxygen XML Editor, the HDITA map would be processed through the same steps as the XDITA map: by clicking on the “Apply Transformation Scenario(s)” button on the main toolbar.
zh_cn: 在 Oxygen XML Editor 中，处理 HDITA 地图的步骤与处理 XDITA 地图的步骤相同：单击主工具栏上的“应用转换选项”按钮。

source: In Oxygen XML Editor, the XDITA map would be processed through the same steps as the DITA map: by clicking on the “Apply Transformation Scenario(s)” button on the main toolbar.
zh_cn: 在 Oxygen XML Editor 中，处理 XDITA 地图的步骤与处理 DITA 地图的步骤相同：单击主工具栏上的“应用转换选项”按钮。

source: In Svenvold's account of the events, the manual was doomed when Carroll applied those principles of minimalism to the production of that specific genre of technical communication.
zh_cn: 在Svenvold看来，卡罗尔将极简主义原理运用至技术传播这一特殊体裁的写作中，写出来的手册就注定是失败的。

source: In XDITA and
zh_cn: 在XDITA和

source: In XDITA and HDITA, the ordered list (<ol>) is a much simpler environment than the definition list, and it only requires one or more instances of a list item (<li>).
zh_cn: 在 XDITA 和 HDITA 中，有序列表 (<ol>) 的内容环境比定义列表简单得多，它只包含一个或多个列表项实例(<li>)。

source: In XDITA and HDITA, the same list must be represented as follows:
zh_cn: 在XDITA和HDITA中，相同的列表必须表示如下：

source: In XDITA and MDITA, a topic requires an @id, which is provided as an attribute of the components <topic> and <article>, respectively.
zh_cn: 在 XDITA 和 MDITA 中，一个话题需要一个 @id，@id将分别作为 <topic> 和 <article>组件的属性。

source: In XDITA, the attribute for a unique identifier at the topic level (the id portion of the <topic id=“franchise-intro”> line) is required.
zh_cn: 在 XDITA 中，需要为话题级别的惟一标识符提供属性（即 <topic id=“franchise-intro”> 中的 id 部分），

source: In XDITA, the body environment can hold several topic components.
zh_cn: 在 XDITA 中，主体组件可以包含多个话题组件。

source: In XDITA, the definition list (<dl>) is a content environment that includes a definition list entry (<dlentry>), a definition term (<dt>), and a definition description (<dd>).
zh_cn: 在 XDITA 中，定义列表标签 (<dl>) 可以创建一个内容环境，环境中包括定义列表条目标签 (<dlentry> )、定义术语标签 (<dt>)和定义描述标签 (<dd>)。

source: In a 2015 teaching case based on the work I did with some colleagues for the course ENGL 3814: Creating User Documentation, we mentioned that whereas “basic XML syntax and tags are relatively easy to teach and learn, the automation of deliverables via XSLT and the DITA Open Toolkit is much more complicated” (Evia et al.
zh_cn: 基于我与同事为课程ENGL 3814: 创建用户文档 所做的工作，在2015的教学案例中，我们提到,而“基本XML语法和标记相对容易教和学,通过XSLT和DITA Open Toolkit实现的可交付成果自动化则要复杂得多”(Evia et al.

source: In a conversation we had a few years ago when he
zh_cn: 在我们几年前的一次谈话中，他

source: In a conversation we had after one of our presentations at a DITA North America conference organized by the Center for Information-Development Management, Priestley pointed out that IBM's DQTI was “all about DITA without mentioning DITA by its name.”
zh_cn: 在一次由信息开发管理中心组织的DITA北美会议展示结束后，我们与普里斯特利进行了交谈，他指出IBM的 DQTI虽然没有提DITA，但实质就是DITA。

source: In a meta application of his own recommendations, Price's description of the features in How to Write a Computer Manual: A Handbook of Software Documentation reflected the organizational patterns of the type of friendly manual promoted in the book.
zh_cn: 在实现他提出的建议的元应用场景中，普莱斯在《如何编写计算机手册：软件文档手册》描述的特征反映了书中推荐的友好手册类型的组织模式。

source: In a previous publication (Evia et al., 2015), I described the approach implemented in the undergraduate course Creating User Documentation at Virginia Tech to teach concepts of intelligent content, DITA, and computational thinking combined with rhetorical problem solving.
zh_cn: 在之前的一篇文章中 (Evia et al., 2015)，我介绍了在弗吉尼亚理工大学的本科课程《用户文档写作》中，将智能内容、DITA和计算机思维等概念与修辞问题解决能力结合起来教授的教学方法。

source: In an interview for the website “DITAWriter,” Don Day, one of the original developers of the DITA standard, chronicled the origins of his XML experiments while working for IBM in the last decade of the 20th century as follows:
zh_cn: 在 DITAWriter 网站的一个采访中，DITA 标准的最初开发人员之一 唐·戴回忆了20世纪末期他在 IBM 工作时进行 XML 探索的缘由：

source: In blogs and social media exchanges, some practitioners have questioned the status of XML, and DITA, as the main markup language for information products.
zh_cn: 在博客和社交媒体的推文中，有的从业者表现出了对 XML 和 DITA 作为信息产品的主要标记语言的质疑。

source: In cases like this one, an LwDITA-aware editor can help with tag autocompletion and authorial guidance.
zh_cn: 在这种情况下，支持 LwDITA 的编辑器可以提供一些帮助，包括自动填充标签和提供写作指引。

source: In conference presentations and publications (Priestley et al., 2001; Priestley, 2001), members of that pioneer team were introducing DITA as the IBM way of authoring and publishing technical documentation.
zh_cn: 在会议报告和出版物中(Priestley等人，2001;Priestley， 2001)， 先锋团队的成员正在引入DITA作为IBM编写和发布技术文档的方式。

source: In conference presentations, we frequently reassure DITA users that the standard, as they know it in its robust XML form, is not going away.
zh_cn: 在会议演示中，我们经常向 DITA 用户保证，DITA 标准不会消失，会以他们知道的健壮的 XML 形式存在。

source: In contrast, taken to its most beneficial extreme, obsessing about order and rules can produce information schemas as revolutionary as those proposed by J.C.R.
zh_cn: 相反，如果是将其良性效用发挥到极致，对秩序和规则的痴迷可能会产生像J.C.R所倡导的那种革命性的信息模式

source: In her Introduction to DITA, JoAnn Hackos described the DITA Open Toolkit as follows:
zh_cn: 在《DITA入门》中, 乔安·哈克斯这样描述DITA Open Toolkit：

source: In her discussion of the characteristic of completeness, she included the following paragraph:
zh_cn: 在讨论完整性的特点时，她阐述了以下内容：

source: In her seminal essay on this topic, Wing explains that computational thinking takes an approach to “solving problems, designing systems and understanding human behavior by drawing on concepts fundamental to computer science” (Wing, 2006, p.
zh_cn: 在温一篇关于计算机思维的开创性文章中，她解释到：计算机思维采取了一种“利用计算机科学的基本概念来解决问题、设计系统和理解人类行为”的方法 (Wing, 2006, p.

source: In his popular textbook Structured Computer Organization, Andrew S. Tanenbaum described computers “as a
zh_cn: 在安德鲁·斯图尔特·特南鲍姆（Andrew S. Tanenbaum）的畅销书《结构化计算机组织》中，他将计算机描述为“

source: In his role as Distinguished Technical Marketer at IBM, James, a graduate of the Master of Science in Scientific and Technical Communication from the University of Minnesota-Twin Cities, was looking for interns who could work in a structured authoring environment.
zh_cn: 他毕业于明尼苏达大学双子城分校（University of Minnesota-Twin Cities），获得了科学与技术传播硕士学位。詹姆斯在 IBM 工作，是出色的一位技术营销人员，曾经一直在寻求能够在结构化创作环境中工作的实习生。

source: In its extended profile, MDITA can incorporate YAML front matter headers and HDITA elements and attributes to overcome Markdown limitations as a language for authoring structured and reusable content.
zh_cn: 在其扩展的概要文件中，MDITA可以兼容YAML前端内容标题和HDITA元素和属性，以克服Markdown作为创作结构化和可复用内容的语言的限制。

source: In most cases, human authors would have to modify font-sizes and paragraph structures manually.
zh_cn: 在大多数情况下，创作者必须手动修改字体大小和段落结构。

source: In most of our conference presentations and webinars about LwDITA, Michael Priestley and I have described the authoring formats of this proposed content standard as ice cream flavors.
zh_cn: 在我们关于LwDITA的大多数会议演示和网络研讨会中，我和迈克尔·普里斯特利将提议的内容标准的创作格式描述为冰淇淋的口味。

source: In my introductory technical writing courses, my students were using Markdown as a shorthand form for web writing.
zh_cn: 在我教的技术写作入门课中，学生将 Markdown 作为网页写作的速记工具。

source: In one of the contrasting moves of their definition, they posit XML as different from Hypertext Markup Language (HTML) and other typesetting and formatting syntaxes because it enables the processes of “identifying, separating, and recombining” content for different purposes (Applen & McDaniel, 2009, p.
zh_cn: 在他们的定义中，有一点非常不同，他们认为 XML 不同于超文本标记语言（HTML）以及其他排版和格式化语法，因为它能够实现针对不同目的“内容识别、内容分离和内容重”（埃普伦、 麦克丹尼尔，2009年，第

source: In order for that automation to be successful, computational thinking requires understanding not only of the concepts that each layer of abstraction represents, but also of the relationships between the multiple layers behind a specific problem.
zh_cn: 为了成功实现自动化，计算机思维不仅需要理解每一抽象层所代表的概念，还需要理解特定问题背后的多个层之间的关系。

source: In practical terms, DITA's topic types include XML tags for content “moves” or strategies (such as a short description, steps, and examples) frequently used in technical publications.
zh_cn: 实际上，DITA 的话题类型包括技术出版物中经常用于内容操作或策略（例如一个简短的描述、步骤和示例）的 XML 标记。

source: In practice, these alternative versions are conjoined: by learning a mechanical system of pigeonholes, one masters patterns of thought that then become habitual and spontaneous.
zh_cn: 再实践中，这些方式常组合使用：通过学习鸽笼的运作机制，人们就可以掌握习惯性和自发性的思维方式。

source: In previous chapters, I have highlighted the role of LwDITA code as an important component of a content-development workflow built on principles of computational thinking.
zh_cn: 在前面的章节中，我已经强调了在基于计算思维原则的内容开发工作流中，LwDITA代码组件扮演了重要的角色。

source: In reality, DITA is a tool as much as HTML is a tool: as open standards, they can have tools built based on them, but the standards are not the tools.
zh_cn: 实际上，DITA和HTML一样是一种工具：作为开放标准，它们可以有基于这些标准构建的工具，但这些标准并非工具。

source: In separate conversations with colleagues in academia (including Bill Hart- Davidson from Michigan State University) and industry (like Radu Coravu, from the Romania-based Syncro Soft), we have had unisonous affirmations of “structure starts in your head.” For a specific type of user, the structure of a simple topic can be in their head as they go through the tasks related to the creation of intelligent.
zh_cn: 在分别与学术界（包括密歇根州立大学的比尔·哈特-戴维森）和工业界（如来自罗马尼亚公司 Syncro Soft 的拉杜·科拉夫）交流后，我们一致肯定：“结构始于思考。”对于特定类型的用户来说，在创建智能内容的过程中，一个简单话题结构一直存在于他们脑中。

source: In short, some new users (and particularly those who are not tech writers by trade) do not necessarily need to experience the full extent of DITA capability.
zh_cn: 简而言之，一些新用户（特别是那些职业不是技术写作人员的用户）不一定需要体验完整版 DITA 的功能。

source: In some cases, LwDITA authors cannot control all the use and reuse cases of their content, but rhetorical effectiveness should be an aspirational value in intelligent content workflows at the planning, authoring and evaluating levels.
zh_cn: 在某些情况下，LwDITA 作者无法控制内容所有的使用和复用情境，但修辞效果应该对智能内容工作流中的规划、写作和评估阶段有着振奋人心的价值。

source: In sum, XDITA was designed for users who could benefit from a DITA-like experience for content creation and publication, but who do not need (or want) the full power of DITA.
zh_cn: 总之，XDITA是为那些可以从类似于DITA的内容创建和发布体验中获益，但不需要(或想要)DITA的全部功能的用户设计的。

source: In sum, in order to achieve efficient automation routines for content, authors (and not necessarily programmers or developers) need to get involved in a structured process involving layers of abstraction and replicable rules.
zh_cn: 总之，为了实现高效的内容自动化例程，创作者（不一定是程序员或开发人员）需要参与一个包含抽象层级和可复制规则的结构化过程。

source: In that initial proposal, which was still depending on XML as its only authoring language, the simplified topic content model included the following elements or topical conventions:
zh_cn: 最初的提议仍然依赖 XML 作为其唯一的创作语言，在最初的提议中，简化的话题内容模型包括以下元素或话题规则：

source: In the 1990s, Carroll's work on minimalist documentation also influenced an IBM technical writer to architect the original DITA schemas for structuring content.
zh_cn: 20世纪90年代，卡罗尔在极简文档上的工作还影响了IBM的一位技术文档工程师，激发他创建了用于结构化内容的原始DITA模式。

source: In the Hayakawas' abstraction ladder, the word “Bessie” “is the lowest verbal level of abstraction,” which leaves out the characteristics that Bessie the cow could have in common with other animals, other farm assets, other general assets, and eventually other sources of wealth for a farmer, omitting further characteristics (Hayakawa & Hayakawa, 1990; p.
zh_cn: 在Hayakawa的抽象阶梯中，“贝西”这个词“是语言最低阶别的抽象”，因为它没有包含贝西牛可能与其他动物、其他农场资产、其他一般资产，以及一个农民最终的财富来源所共同的特性 ，略去了更深层次的特征 (Hayakawa & Hayakawa, 1990; p.
